---
kind: property
id: P:Autodesk.Revit.DB.Connector.IsMovable
zh: 连接件、接口
source: html/38caddc0-921d-9c71-08cd-fa393bb4909f.htm
---
# Autodesk.Revit.DB.Connector.IsMovable Property

**中文**: 连接件、接口

whether the connector can be moved.

## Syntax (C#)
```csharp
public bool IsMovable { get; }
```

## Remarks
Only connectors of type EndConn can be moved.